{
  "Name": "Dmitry Starchenko",
  "Personal": "Personal information",
  "Education": "Education",
  "Experience": "Experience",
  "Skills": "Skills",
  "AddInformation": "Additional information",
  "Projects": "Projects",
  "Lives": "Lives:",
  "LivesText": "Gomel, Republic of Belarus",
  "Citizenship": "Citizenship:",
  "CitizenshipText": "Republic of Belarus",
  "Gender": "Gender:",
  "GenderText": "Male",
  "Ed": "Education:",
  "EducationText": "Higher",
  "Birth": "Date of birth:",
  "BirthText": "28.04.1992",
  "Status": "Marital status:",
  "StatusText": "Married (two children)",
  "Certificate": "Certificate",
  "Un": "Francisk Skorina Gomel State University",
  "UnDesc": "Pedagogical Institute, physical education, trainer",
  "ExpDescNode": "Node JS\n\nDeveloping application servers using Node.js and Nest.js.\nAcquired skills:\n- Deep knowledge of Node.js;\n- Experience developing servers based on Nest.js;\n- Usage:\n• for network communications: HTTP and WebSocket;\n• for WebAPI: REST and GraphQL;\n• for the database: PostgreSQL;\n• for containerization: Docker;\n- Using npm, git;\n- Confident use of Git and GitHub, the ability to understand other people's code and find errors;\n- Working with code formatting linters (ESLint, Prettier);\n- Experience writing Jest tests;",
  "ExpDescReact": "React \n\nDeveloping responsive applications with React.js and Next.js.\nSkills Acquired: \n- Deep knowledge of React.js, including React Router and React Hook Form; \n- Experience developing applications using the following stacks: Next.js, MUI, Vitest, Supabase, Redux or Jotai, Next-intl, i18n, Yup or Zod; \n- Using REST APIs, Axios (working with the HTTP protocol (GET, POST, PATCH, PUT)); \n- Using npm, git, and devtools, including React Dev Tools Profiler; \n- Experience working with CSS modules; \n- Confident use of Git and GitHub, ability to understand other people's code and find errors;\n- Experience setting up and building Vite projects;\n- Working with code formatting linters (Stylelint, ESLint,Prettier); \n- Experience writing tests in Vitest and Jest;\n- Knowledge and application of Agile methodologies (Kanban,Scrum); \n- Ability to work with Jira and Trello task boards;\n- Communication skills, teamwork, and a focus on results.",
  "ExpDescJs": "JavaScript/Front-end \n\nDevelopment of adaptive SPA applications on JavaScript and React.js. \nSkills acquired: \n- deep knowledge of JavaScript, including working with TypeScript, ES6; \n- experience in developing an eCommerce application on the stack: React, MUI, React Router, Vite, Vitest; \n- using REST API (working with the HTTP protocol (GET, POST, PATCH, PUT)); \n- working with the Commercetools e-commerce platform; \n- using npm, git, devtools; - understanding of basic design patterns, OOP; \n- good knowledge of HTML, CSS and SVG, including adaptive, cross-browser and semantic markup; \n- experience with CSS preprocessors SASS, SCSS; \n- experience with BEM and CSS Modules; \n- confident use of Git and GitHub, ability to understand other people's code and look for errors; \n- experience in configuring and assembling projects on WebPack and Vite; \n- working with linters for code formatting (Stylelint, ESLint, Prettier, Editorconfig); \n- experience writing tests on Vitest, Jest; \n- knowledge of Figma and experience in layout in Pixel perfect; \n- knowledge and use of Agile methodologies (Kanban, Scrum); \n- ability to work with a task board; \n- communication skills, teamwork, focus on results.",
  "Knowledge": "Knowledge of languages",
  "lang": "Russian - native \nBelarusian - native \nEnglish - A1",
  "informationTitleOne": "Having a driving license:",
  "informationTitleTwo": "Personal qualities:",
  "informationDescriptionOne": "I can find a common language with different people, establish contact, I can work in a team, I am stress-resistant",
  "informationTitleThree": "Professional skills:",
  "informationTitleFour": "About me:",
  "informationDescriptionTwo": "I am ready to take on obligations and fulfill them on time, I am diligent and punctual. I am able to work without constant supervision, I know how to plan and structure my work, and quickly adapt to new conditions.",
  "informationDescriptionThree": "I am looking for a job with the aim of doing what interests me, working on interesting and complex projects in order to realize my potential and continue to develop professionally. Independent and proactive. Ready to take on new and interesting tasks for their implementation. I have the skills of self-organization and self-discipline, planning and managing task priorities, searching for and analyzing new information for myself, skills in working on mistakes. I have a great desire to learn and develop. I am actively improving my level of English.",
  "Contacts": "Contacts",
  "Menu": "Menu",
  "": "",
  "": "",
  "": ""
}
