{
  "Name": "Дмитрий Старченко",
  "Personal": "Персональная информация",
  "Education": "Образование",
  "Experience": "Опыт",
  "Skills": "Навыки",
  "AddInformation": "Дополнительная информация",
  "Projects": "Проекты",
  "Lives": "Место проживания:",
  "LivesText": "Гомель, Республика Беларусь",
  "Citizenship": "Гражданство:",
  "CitizenshipText": "Беларус",
  "Gender": "Пол:",
  "GenderText": "Мужской",
  "Ed": "Образование:",
  "EducationText": "Высшее",
  "Birth": "Дата рождения:",
  "BirthText": "28.04.1992",
  "Status": "Семейное положение:",
  "StatusText": "Женат (двое детей)",
  "Certificate": "Сертификат",
  "Un": "Гомельский государственный университет им. Ф.Скорины",
  "UnDesc": "Педагогический университет, физическое воспитание, тренер",
  "ExpDescReact": "React \n\nРазработка адаптивных приложений с помощью React.js и Next.js.\nПриобретенные навыки: \n- Глубокие знания React.js, включая React Router и React Hook Form; \n- Опыт разработки приложений с использованием следующих стеков: Next.js, MUI, Vitest, Supabase, Redux или Jotai, Next-intl, i18n, Yup или Zod; \n- Использование REST API, Axios (работа с HTTP-протоколом (GET, POST, PATCH, PUT)); \n- Использование npm, git и devtools, включая React Dev Tools Profiler; \n- Опыт работы с CSS-модулями; \n- Уверенное использование Git и GitHub, умение разбираться в чужом коде и находить ошибки;\n- Опыт настройки и создания проектов Vite;\n- Работа с линтерами форматирования кода (Stylelint, ESLint,Prettier); \n- Опыт написания тестов в Vitest и Jest;\n- Знание и применение методологий (Kanban, Scrum); \n- Умение работать с досками задач Jira и Trello;\n- Коммуникативные навыки, командная работа и нацеленность на результат.",
  "ExpDescJs": "JavaScript/Front-end \n\nРазработка адаптивных SPA-приложений на JavaScript и React.js. \nПриобретенные навыки: \n- глубокие знания JavaScript, включая работу с TypeScript, ES6; \n- опыт разработки приложений электронной коммерции на стеке: React, MUI, React Router, Vite, Vitest; \n- с использованием REST API (работа по протоколу HTTP (GET, POST, PATCH, PUT)); \n- работа с платформой электронной коммерции Commercetools; \n- использование npm, git, devtools; \n- понимание основных шаблонов проектирования, ООП; \n- хорошее знание HTML, CSS и SVG, включая адаптивную, кроссбраузерную и семантическую разметку; \n- опыт работы с CSS-препроцессорами SASS, SCSS; \n- опыт работы с модулями БЭМ и CSS; \n- уверенное использование Git и GitHub, умение разбираться в чужом коде и искать ошибки; \n- опыт настройки и сборки проектов на WebPack и Vite; \n- работа с линтерами для форматирования кода (Stylelint, ESLint, Prettier, Editorconfig); \n- опыт написания тестов на Vitest, Jest; \n- знание Figma и опыт верстки в Pixel Perfect; \n- знание и использование методологий (Kanban, Scrum); \n- умение работать с доской задач; \n- коммуникативные навыки, работа в команде, нацеленность на результат.",
  "Knowledge": "Знание языков",
  "lang": "Русский - родной \nБелорусский - родной \nАнглийский - A1",
  "informationTitleOne": "Наличие водительских прав:",
  "informationTitleTwo": "Личные качества:",
  "informationDescriptionOne": "Умею находить общий язык с разными людьми, устанавливать контакт, умею работать в команде, стрессоустойчив.",
  "informationTitleThree": "Профессиональные навыки:",
  "informationTitleFour": "Обо мне:",
  "informationDescriptionTwo": "Готов брать на себя обязательства и выполнять их в срок, добросовестный и пунктуальный. Умею работать без постоянного контроля, умею планировать и структурировать свою работу, быстро адаптируюсь к новым условиям.",
  "informationDescriptionThree": "Ищу работу, которая позволит мне заниматься тем, что мне интересно, работать над интересными и сложными проектами, реализовывать свой потенциал и профессионально развиваться. Самостоятельный и инициативный. Готов брать на себя новые и интересные задачи для их реализации. Обладаю навыками самоорганизации и самодисциплины, планирования и управления приоритетами задач, поиска и анализа новой для себя информации, навыками работы над ошибками. Огромное желание учиться и развиваться. Активно повышаю свой уровень английского языка."
}
